; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v7 - type_3 ?v5 - type_1)
 	      (pred_3 ?v8 - object ?v5 - type_1)
	      (pred_4 ?v7 - type_3 ?v1 - type_2)
	      (pred_2 ?v7 - type_3 ?v8 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v7 - type_3 ?v3 ?v4 - type_1)
       :precondition (and  (pred_1 ?v7 ?v3))
       :effect (and  (pred_1 ?v7 ?v4)
		     (not (pred_1 ?v7 ?v3))))

   (:action op_3
       :parameters (?v7 - type_3 ?v2 - object ?v6 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v2 ?v6) (pred_1 ?v7 ?v6) (pred_4 ?v7 ?v1))
       :effect (and (pred_2 ?v7 ?v2 ?v1)
		    (not (pred_3 ?v2 ?v6)) 
		    (not (pred_4 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_3 ?v2 - object ?v6 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v7 ?v2 ?v1) (pred_1 ?v7 ?v6))
       :effect (and (pred_3 ?v2 ?v6)
		    (pred_4 ?v7 ?v1)
		    (not (pred_2 ?v7 ?v2 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_09 - type_3
obj_05 obj_06 - type_2
obj_04 obj_02 obj_03 - type_1
obj_01 obj_08 obj_07 - object)
(:init
(pred_1 obj_09 obj_02)
(pred_4 obj_09 obj_05)
(pred_4 obj_09 obj_06)
(pred_3 obj_01 obj_02)
(pred_3 obj_08 obj_02)
(pred_3 obj_07 obj_02)
)
(:goal
(and
(pred_3 obj_01 obj_03)
(pred_3 obj_08 obj_02)
(pred_3 obj_07 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_09 ?b obj_06))))
)
)

; plan
1. (op_3 obj_09 obj_01 obj_02 obj_05)
   deleted: (pred_3 obj_01 obj_02) (pred_4 obj_09 obj_05)
   added: (pred_2 obj_09 obj_01 obj_05)
   goals met: 1 of 3
2. (op_1 obj_09 obj_02 obj_03)
   deleted: (pred_1 obj_09 obj_02)
   added: (pred_1 obj_09 obj_03)
   goals met: 1 of 3
3. (op_2 obj_09 obj_01 obj_03 obj_05)
   deleted: (pred_2 obj_09 obj_01 obj_05)
   added: (pred_3 obj_01 obj_03) (pred_4 obj_09 obj_05)
   goals met: 2 of 3
4. (op_1 obj_09 obj_03 obj_02)
   deleted: (pred_1 obj_09 obj_03)
   added: (pred_1 obj_09 obj_02)
   goals met: 2 of 3
5. (op_3 obj_09 obj_07 obj_02 obj_05)
   deleted: (pred_3 obj_07 obj_02) (pred_4 obj_09 obj_05)
   added: (pred_2 obj_09 obj_07 obj_05)
   goals met: 2 of 3
6. (op_1 obj_09 obj_02 obj_04)
   deleted: (pred_1 obj_09 obj_02)
   added: (pred_1 obj_09 obj_04)
   goals met: 2 of 3
7. (op_2 obj_09 obj_07 obj_04 obj_05)
   deleted: (pred_2 obj_09 obj_07 obj_05)
   added: (pred_3 obj_07 obj_04) (pred_4 obj_09 obj_05)
   goals met: 3 of 3
